<template>
  <header class="main-header">
    <div class="road">
      <svg
        class="absolute"
        width="1494"
        height="690"
        viewBox="0 0 1494 690"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          opacity="0.4"
          d="M-68.1489 118.122C-23.4636 128.413 10.0155 149.959 32.526 119.819M41.394 118.122C72.444 98.8222 98.8603 73.2167 129.416 47.0725M129.425 43.3953C149.652 25.176 157.958 6.37621 173.59 2.35614M177.686 7.30555C217.704 -3.97394 275 10.8607 305.168 48.1566M297.419 50.6132C302.166 65.4123 316.673 89.4531 319.452 112.379M311.43 120.67C312.289 140.874 300.046 170.141 300.117 191.132M299.966 193.132C283.977 219.443 319.88 264.472 358.611 273.79M354.172 278.049C377.503 281.249 418.903 290.143 441.602 290.905M434.984 282.437C465.576 266.021 491.847 245.675 498.622 232.574M503.059 230.213C518.898 219.198 526.513 206.164 524.781 197.477M531.79 194.548C539.625 178.232 544.981 165.671 550.795 151.435M553.443 153.787C559.45 125.531 580.023 104.238 603.086 86.2135M598.732 89.5335C625.131 71.674 671.647 47.5352 707.354 21.0622M697.519 27.8272C734.657 21.017 783.953 -5.83636 819.452 25.6631M827.725 16.2218C860.102 28.3565 914.073 59.1831 918.726 97.1742M923.965 106.8C937.814 130.078 932.567 149.764 925.634 184.483M927.927 176.998C931.642 205.666 933.501 225.662 928.957 245.202M923.965 235.308C917.236 258.352 908.775 294.597 871.071 304.055M879.525 309.185C848.017 331.04 801.06 361.915 817.021 425.377M813.855 416.181C817.491 481.039 905.952 489.283 937.326 471.938M944.345 479.869C985.837 486.753 1004.89 464.783 1053.5 454.586M1044.97 460.904C1080.36 445.022 1135.28 464.961 1170.73 474.293M1165.69 469.112C1198.61 482.444 1213.43 500.3 1227.83 541.188M1225.84 533.366C1236.16 562.735 1198.53 584.37 1191.46 604.203M1187.21 597.62C1178.38 599.922 1159.44 615.706 1151.58 622.932M1143.05 632.861C1138.01 655.114 1145.77 668.794 1143.66 685.016M1150.13 676.593C1195.57 728.4 1263.53 715.176 1338.81 702.887M1331 709.144C1360.6 718.21 1403.18 701.692 1451.18 730.178M1448.47 720.608C1453.26 732.367 1481.9 741.82 1491.82 735.918"
          stroke="#AB9995"
          stroke-width="3"
          stroke-linecap="round"
          stroke-dasharray="9 9"
        />
      </svg>
      <svg
        class="absolute-2"
        width="486"
        height="335"
        viewBox="0 0 486 335"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          opacity="0.6"
          d="M-47.769 48.4432C-21.8654 67.4578 14.6773 72.5493 46.8918 64.8229M43.9413 68.8233C63.3154 67.3536 79.4093 66.896 111.961 59.5581M107.629 56.6519C120.643 58.1936 140.164 28.0438 170.849 37.0365M168.911 29.3369C193.611 22.53 222.119 9.45926 246.67 19.1521M239.533 10.7967C270.02 -2.74578 318.145 3.27805 359.686 5.75284M358.7 5.13559C403.567 13.3264 437.698 41.9135 463.09 82.4142M455.223 75.1921C471.523 101.334 468.442 111.847 484.138 146.235M478.999 138.455C480.651 166.318 472.055 173.814 451.437 210.751M450.411 201.294C441.042 231.332 392.666 243.821 364.708 258.581M371.155 266.397C338.972 277.06 289.667 274.303 260.105 308.716M256.658 309.846C230.657 328.34 221.951 363.847 226.603 380.619M224.744 389.2C224.857 389.75 224.974 389.462 224.639 390"
          stroke="#AB9995"
          stroke-width="3"
          stroke-linecap="round"
          stroke-dasharray="9 9"
        />
      </svg>
      <svg
        class="absolute-3"
        width="421"
        height="660"
        viewBox="0 0 421 660"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          opacity="0.6"
          d="M177.895 -27.5789C166.603 62.1451 101.809 113.089 34.0392 176.088M43.0186 169.712C25.0985 194.926 18.2966 205.082 12.3409 229.795M5.9382 233.399C-0.271982 262.076 10.0756 275.507 1.66943 298.704M7.77807 301.05C26.5619 346.882 55.8046 390.548 108.687 391.9M112.651 392.76C143.079 396.18 157.199 390.456 175.054 372.005M173.366 373.795C202.694 359.268 215 357.687 243.131 353.204M246.536 352C275.155 351.784 322.996 385.183 331.987 408.978M334.708 411.159C346.059 451.899 336.33 478.334 325.416 522.302M334.567 522.683C333.057 539.541 321.623 571.841 353.917 588.973M344.615 596.561C361.846 626.23 387.515 649.036 435.42 653.278M432.646 657.701C475.772 661.913 504.555 621.76 515.427 586.352"
          stroke="#AB9995"
          stroke-width="3"
          stroke-linecap="round"
          stroke-dasharray="9 9"
        />
      </svg>
      <svg class="absolute-4" width="262" height="115" viewBox="0 0 262 115" fill="none" xmlns="http://www.w3.org/2000/svg">
<path opacity="0.6" d="M42.3521 149.429C16.8908 142.993 0.136664 123.813 2.22461 96.9316M4.28096 97.2056C-1.85691 74.7067 10.9357 58.4123 33.8792 47.3754M28.3408 47.5291C55.2502 33.9979 74.4933 24.7284 79.7752 7.27743M89.3395 10.5902C104.275 -1.39057 123.292 0.848551 141.059 4.84701M145.385 1.67394C151.388 16.2966 170.274 16.4216 186.873 20.5914M178.502 28.2813C187.897 48.4849 203.899 49.495 219.092 58.7372M216.149 65.3617C247.279 92.0701 245.723 126.377 259.608 179.079" stroke="#AB9995" stroke-width="3" stroke-linecap="round" stroke-dasharray="9 9"/>
</svg>
<svg class="absolute-5" width="278" height="95" viewBox="0 0 278 95" fill="none" xmlns="http://www.w3.org/2000/svg">
<path opacity="0.6" d="M2.29834 142.167C24.9638 100.581 55.7292 48.8788 105.918 27.5342M95.7576 35.3937C96.5629 35.4839 96.7079 35.7536 96.6333 35.6266M96.6563 35.4329C126.796 26.9654 177.218 6.30067 209.907 12.0274M203.269 2.05402C323.931 4.11196 263.912 160.223 233.621 208.012" stroke="#AB9995" stroke-width="3" stroke-linecap="round" stroke-dasharray="9 9"/>
</svg>
    </div>
    <div class="container">
      <nav class="header-nav">
        <div><img src="../../assets/images/logoi.png" alt="logo" /></div>
        <ul>
          <li>Алматы</li>
          <li>Астана</li>
          <li>Другие</li>
          <li>О нас</li>
        </ul>
      </nav>
      <div class="main-div-content">
        <div>
          <h1>Алматы</h1>
          <p>прогулка по «немецкой» истории города</p>
        </div>
        <div>
          <img src="../../assets/images/Almaty.png" alt="" />
        </div>
      </div>
    </div>
  </header>
</template>

<style lang="scss" scoped>
.main-header {
  position: relative;
  overflow: hidden;
  margin-bottom: 160px;

  .road {
    .absolute {
      position: absolute;
      top: 20%;
      left: 5%;
    }

    .absolute-2 {
      position: absolute;
      top: 55%;
    }
    .absolute-3 {
      position: absolute;
      right: 0;
    }
    .absolute-4 {
      position: absolute;
      bottom: 0;
      right: 5%;
    }
    .absolute-5 {
      position: absolute;
      bottom: 0;
      left: 30%;
    }
  }
}

@mixin Flexbox {
  display: flex;
  align-items: center;
}
@mixin Header_text(
  $head-color: #5c5754,
  $head-size: 18px,
  $head-line-height: 22px,
  $head-weight: 600
) {
  font-size: $head-size;
  line-height: $head-line-height;
  font-weight: $head-weight;
  color: $head-color;
  text-transform: uppercase;
}

header {
  background: #f9f7f3;
  width: 100%;
  height: 100%;
  padding-bottom: 149px;
}

.header-nav {
  @include Flexbox;
  justify-content: space-between;
  ul {
    @include Flexbox;
    @include Header_text();
  }
  li {
    list-style: none;
    margin: 0 49px;
    cursor: pointer;
  }
  img {
    background-color: transparent;
    position: relative;
    z-index: 100;
  }
}

.main-div-content {
  @include Flexbox;
  justify-content: space-between;
  h1 {
    @include Header_text(#5c5754, 56px, 88px, 400);
  }
  p {
    @include Header_text(
      $head-color: #ab9995,
      $head-size: 12px,
      $head-weight: 400
    );
  }
  img {
    background: transparent;
    position: relative;
    z-index: 100;
  }
}
</style>
