<template>
    <div class="container">
        <h1 class="h1-center">текст с заголовком</h1>
        <div class="flex">
            <div class="div-flex-content">
                Немецкая история Верного – Алма-Аты – Алматы начинается буквально с момента основания города в 1854 г. С середины 19 в. здесь в молодом городе Туркестанского края жили и работали не только чиновники немецкого происхождения, но и немецкие ученые и путешественники: ботаник-натуралист А.Шренк, путешественник, врач и исследователь растительного мира Туркестанского края Иоганн-Альберт Регель, садовод К.Штольц, лесоводы братья Баум и другие. 
<br>
<br>
В советский период истории в нашем городе жили и работали немцы – представители творческой и научной интеллигенции, архитекторы, известные спортсмены, врачи и многие другие. Многие из них были депортированы в 1941 г. из различных мест проживания этнических немцев в СССР и расселены в разных областях Казахской ССР, а с ослаблением режима спецпоселения, когда появилась возможностью работать и учиться в столице Казахстана, переехали в Алма-Ату. 
<br>
<br>
<span>Надеемся, что наша экскурсия поможет вам в осмыслении исторического прошлого своего народа и сохранении достойной памяти о нем!</span>
            </div>
            <div class="div-flex-content-image"><img src="../../assets/images/FirstC.png" alt=""></div>
        </div>
    </div>
</template>

<style lang="scss" scoped>
.h1-center{
    text-align: center;
    margin-bottom: 55px;
    text-transform: uppercase;
}
.flex{
    display: flex;
    align-items: center;
    justify-content: space-between;
    width: 100%;
}
.div-flex-content{
    width: 36%;
    font-size: 18px;
    line-height: 28px;
    font-weight: 500;
    color: #72767E;
    span{
        color: #5C5754;
    }
}
</style>